app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (account = NULL) ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    logger.info "Index User info"
    Rails.logger.info "sample text"
  @user=User.find(:first, :conditions=>["account = ?", params[:account]])

INSERT INTO `users` (`account`, `balance`, `created_at`, `name`, `pin`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["account", 1206], ["balance", 5000.0], ["created_at", Sun, 12 Oct 2014 11:49:06 UTC +00:00], ["name", "Devraju"], ["pin", 1206], ["updated_at", Sun, 12 Oct 2014 11:49:06 UTC +00:00]]
SELECT `users`.* FROM `users` WHERE (account = '1206') ORDER BY `users`.`id` ASC LIMIT 1
---
  def create

    if(params.has_key?(:account) && params.has_key?(:balance) && params.has_key?(:name) && params.has_key?(:pin))
      @user=User.new(user_params)
      if @user.save
         redirect_to root_url
       else
         render "new"
       end
    elsif params.has_key?(:account)
     @user=User.find(:first, :conditions=>["account = ?", params[:account]])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 12]]
---
  def home
    @user = User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `users` SET `balance` = ?, `updated_at` = ? WHERE `users`.`id` = 1  [["balance", 4000.0], ["updated_at", Sun, 12 Oct 2014 11:49:35 UTC +00:00]]
---
  def withdraw_money
    @user=User.find(session[:user_id])

    if params[:balance].to_f > @user.balance

      redirect_to withdrw_err_path
     else

      @user.balance=@user.balance - params[:balance].to_f
      @user.update_attribute(:balance, @user.balance)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def withdrw_err
     @user=User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
---
  def withdrw_succ
    @user=User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
---
  def deposite_succ
    @user=User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `users` SET `balance` = ?, `updated_at` = ? WHERE `users`.`id` = 1  [["balance", 10000.0], ["updated_at", Sun, 12 Oct 2014 11:49:46 UTC +00:00]]
---
  def deposite_money
    @user=User.find(session[:user_id])
    @user.balance=@user.balance + params[:balance].to_f
      @user.update_attribute(:balance, @user.balance)